In [1]:
import pandas as pd

In [2]:
series_test = pd.Series([1, 2, 3, 4, 5, 7])

In [3]:
series_test

0    1
1    2
2    3
3    4
4    5
5    7
dtype: int64

In [4]:
series_test2 = pd.Series([1, 2, 3, 'test'])

In [5]:
series_test2

0       1
1       2
2       3
3    test
dtype: object

In [6]:
series_test3 = pd.Series([1, 2, 3, 4.0])
series_test3

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [7]:
series_test.index

RangeIndex(start=0, stop=6, step=1)

In [8]:
test_dict = {'A':1, 'B':2, 'C':3, 'D':4, 'E':5}
series_test2 = pd.Series(test_dict)

In [9]:
series_test2

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [10]:
series_test

0    1
1    2
2    3
3    4
4    5
5    7
dtype: int64

In [11]:
series_test[2] = 'string'

In [12]:
series_test

0         1
1         2
2    string
3         4
4         5
5         7
dtype: object

In [13]:
series_test[4] = 'ㅁㄴㅇㄹ'

In [14]:
series_test

0         1
1         2
2    string
3         4
4      ㅁㄴㅇㄹ
5         7
dtype: object

In [15]:
test_array = np.array([1, 2, 3, 4, 5])
test_array

array([1, 2, 3, 4, 5])

In [16]:
test_array[3] = "string"
test_array

ValueError: invalid literal for int() with base 10: 'string'

In [17]:
test_array[3] = "4.5"
test_array

ValueError: invalid literal for int() with base 10: '4.5'

In [18]:
test_series_array = pd.Series(test_array)
test_series_array

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [19]:
test_series_array[3] = 'string'

In [20]:
test_series_array[:2]

0    1
1    2
dtype: object

In [21]:
series_test[::-1]

5         7
4      ㅁㄴㅇㄹ
3         4
2    string
1         2
0         1
dtype: object

In [22]:
series_test

0         1
1         2
2    string
3         4
4      ㅁㄴㅇㄹ
5         7
dtype: object

In [23]:
series_test[[0, 3, 1]]

0    1
3    4
1    2
dtype: object

In [24]:
series_test.head(2)

0    1
1    2
dtype: object

In [25]:
series_test.tail(2)

4    ㅁㄴㅇㄹ
5       7
dtype: object

In [26]:
test_dict = {'names': ['Jake', 'Eunice', 'Philip', 'Karen']}
test_dict

{'names': ['Jake', 'Eunice', 'Philip', 'Karen']}

In [27]:
frame_test = pd.DataFrame(test_dict)
frame_test

    names
0    Jake
1  Eunice
2  Philip
3   Karen

In [28]:
frame_test_column = pd.DataFrame.from_dict(test_dict, orient='columns')
frame_test_index = pd.DataFrame.from_dict(test_dict, orient='index')

In [29]:
frame_test_column

    names
0    Jake
1  Eunice
2  Philip
3   Karen

In [30]:
frame_test_index

          0       1       2      3
names  Jake  Eunice  Philip  Karen

In [31]:
frame_test['names'][3]

'Karen'

In [32]:
frame_test_index[2]['names']

'Philip'

In [33]:
frame_test.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
frame_test.columns

Index(['names'], dtype='object')

In [35]:
frame_test

    names
0    Jake
1  Eunice
2  Philip
3   Karen

In [36]:
for col in frame_test.columns:
    print(frame_test[col])

0      Jake
1    Eunice
2    Philip
3     Karen
Name: names, dtype: object

In [37]:
frame_test.describe()

        names
count       4
unique      4
top     Karen
freq        1

In [38]:
frame_test

    names
0    Jake
1  Eunice
2  Philip
3   Karen

In [39]:
frame_test['names'] == 'Eunice'

0    False
1     True
2    False
3    False
Name: names, dtype: bool

In [40]:
frame_test['names'] < 'Eunice'

0    False
1    False
2    False
3    False
Name: names, dtype: bool

In [41]:
frame_test['names'] > 'Eunice'

0     True
1    False
2     True
3     True
Name: names, dtype: bool

In [58]:
test_dict2 = {'name':['Jake','Eunice','Philip','Karen'],
              'enter':[2011,2016,2017,2014]}

In [59]:
default_df = pd.DataFrame(test_dict2)
default_df

     name  enter
0    Jake   2011
1  Eunice   2016
2  Philip   2017
3   Karen   2014

In [51]:
default_df['enter'].rank(ascending=False)

0    4.0
1    2.0
2    1.0
3    3.0
Name: enter, dtype: float64

In [61]:
default_df.append({'name' : 'test1', 'enter' : 2030}, ignore_index=True)

     name  enter
0    Jake   2011
1  Eunice   2016
2  Philip   2017
3   Karen   2014
4   test1   2030

In [62]:
default_df.append(['test2', 2040], )

       0   enter    name
0    NaN  2011.0    Jake
1    NaN  2016.0  Eunice
2    NaN  2017.0  Philip
3    NaN  2014.0   Karen
4  test2     NaN     NaN
5   2040     NaN     NaN

In [44]:
default_df.set_index('name')

        enter
name
Jake     2011
Eunice   2016
Philip   2017
Karen    2014

In [45]:
default_df.reset_index()

   index    name  enter
0      0    Jake   2011
1      1  Eunice   2016
2      2  Philip   2017
3      3   Karen   2014

In [46]:
default_df.set_index('enter', inplace=True)

In [47]:
default_df

         name
enter
2011     Jake
2016   Eunice
2017   Philip
2014    Karen

In [67]:
copied_df = default_df.reset_index().copy()

In [68]:
copied_df

   enter    name
0   2011    Jake
1   2016  Eunice
2   2017  Philip
3   2014   Karen

In [69]:
copied_df = default_df.reset_index()
copied_df

   enter    name
0   2011    Jake
1   2016  Eunice
2   2017  Philip
3   2014   Karen

In [71]:
copied_df['name'][3]

'Karen'

In [70]:
copied_df['name'][3] == 'Song'
copied_df

   enter    name
0   2011    Jake
1   2016  Eunice
2   2017  Philip
3   2014   Karen

In [73]:
copied_df

   enter    name
0   2011    Jake
1   2016  Eunice
2   2017  Philip
3   2014   Karen

In [75]:
copied_df.set_index('enter', inplace=True)

In [86]:
copied_df.reindex(range(2011, 2020))

         name
enter
2011     Jake
2012      NaN
2013      NaN
2014    Karen
2015      NaN
2016   Eunice
2017   Philip
2018      NaN
2019      NaN

In [87]:
df2 = copied_df.reindex(range(2011, 2020))

In [88]:
df2.fillna(value='NoName', inplace=True)
df2

         name
enter
2011     Jake
2012   NoName
2013   NoName
2014    Karen
2015   NoName
2016   Eunice
2017   Philip
2018   NoName
2019   NoName

In [90]:
df2['new_none_col'] = None
df2

         name new_none_col
enter
2011     Jake         None
2012   NoName         None
2013   NoName         None
2014    Karen         None
2015   NoName         None
2016   Eunice         None
2017   Philip         None
2018   NoName         None
2019   NoName         None

In [82]:
df2['new_none_col'] = None
df2

         name  new_col new_none_col
enter
2011     Jake        0         None
2012   NoName        0         None
2013   NoName        0         None
2014    Karen        0         None
2015   NoName        0         None
2016   Eunice        0         None
2017   Philip        0         None
2018   NoName        0         None
2019   NoName        0         None

In [85]:
df2['new_none_col'].fillna(value='value')
df2

         name  new_col new_none_col
enter
2011     Jake        0         None
2012   NoName        0         None
2013   NoName        0         None
2014    Karen        0         None
2015   NoName        0         None
2016   Eunice        0         None
2017   Philip        0         None
2018   NoName        0         None
2019   NoName        0         None

In [91]:
copied_df

         name
enter
2011     Jake
2016   Eunice
2017   Philip
2014    Karen

In [94]:
copied_df = copied_df.append(pd.Series(name=2020))
copied_df

<ipython-input-94-b3f45dbf9be8>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  copied_df = copied_df.append(pd.Series(name=2020))

         name
enter
2011     Jake
2016   Eunice
2017   Philip
2014    Karen
2020      NaN

In [1]:
import pandas as pd

In [2]:
alco_data = {'D1':[1.36,3.14],'D2':[0.42,0.29],'D3':[0.7, 0.68], 'D4':[np.nan,np.nan]}
alco_with_nan = pd.DataFrame(alco_data, index=['A','B'])

In [3]:
alco_with_nan

     D1    D2    D3  D4
A  1.36  0.42  0.70 NaN
B  3.14  0.29  0.68 NaN

In [4]:
data = [1, 2, 3 ,4]
data_series = pd.Series(data,  index=["D1", "D2", "D3", "D4"])
alco_with_nan.append(data_series, ignore_index=True)

     D1    D2    D3   D4
0  1.36  0.42  0.70  NaN
1  3.14  0.29  0.68  NaN
2  1.00  2.00  3.00  4.0

In [21]:
data = [1, 2, 3 ,4]
data_series = pd.Series(data,  index=["D1", "D2", "D3", "D4"])
alco_with_nan = alco_with_nan.append(data_series, ignore_index=True)

In [22]:
alco_with_nan.iloc[0]

D1    1.36
D2    0.42
D3    0.70
D4     NaN
Name: 0, dtype: float64

In [23]:
alco_with_nan.iloc[1, 1]

0.29

In [24]:
alco_with_nan.iloc[0:2]

     D1    D2    D3  D4
0  1.36  0.42  0.70 NaN
1  3.14  0.29  0.68 NaN

In [25]:
alco_with_nan.iloc[:, 2]

0    0.70
1    0.68
2    3.00
Name: D3, dtype: float64

In [28]:
alco_with_nan.iloc[[1, 1]]

     D1    D2    D3  D4
1  3.14  0.29  0.68 NaN
1  3.14  0.29  0.68 NaN

---

In [77]:
alco_with_nan = alco_with_nan.append(pd.Series(name='C'))
alco_with_nan

<ipython-input-77-ccd2bf0786a4>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  alco_with_nan = alco_with_nan.append(pd.Series(name='C'))

     D1    D2    D3  D4
A  1.36  0.42  0.70 NaN
B  3.14  0.29  0.68 NaN
C   NaN   NaN   NaN NaN

In [78]:
alco_with_nan.reindex(['A',2,'C'])

     D1    D2   D3  D4
A  1.36  0.42  0.7 NaN
2   NaN   NaN  NaN NaN
C   NaN   NaN  NaN NaN

In [81]:
alco_with_nan.reindex(['A','B','C'], method='pad')

     D1    D2    D3  D4
A  1.36  0.42  0.70 NaN
B  3.14  0.29  0.68 NaN
C   NaN   NaN   NaN NaN